import { I_dateShift } from "./types";

export const dateShifts: I_dateShift[] = [
    {
        dateArray: [1404, 1, 3],
        shifts: [
            { 
                hub:{
                    name:'هاب تهران',
                    address:'تهران شریعتی نرسیده به پل رومی',
                    id:12,
                    lat:51.453534,
                    lng:35.45645
                },
                number:'123456',
                timeRange: [8, 11], 
                amount: 12300000, 
                zone: 'میدان انقلاب (هاب نواب)', 
                date: '1404/3/4', 
                id: 0 
            },
            { 
                hub:{
                    name:'هاب تهران',
                    address:'تهران شریعتی نرسیده به پل رومی',
                    id:12,
                    lat:51.453534,
                    lng:35.45645
                },
                number:'123456',
                timeRange: [8, 11], 
                amount: 12300000, 
                zone: 'میدان انقلاب (هاب نواب)', 
                date: '1404/3/4', 
                id: 1 
            },
            { 
                hub:{
                    name:'هاب تهران',
                    address:'تهران شریعتی نرسیده به پل رومی',
                    id:12,
                    lat:51.453534,
                    lng:35.45645
                },
                number:'123456',
                timeRange: [8, 11], 
                amount: 12300000, 
                zone: 'میدان انقلاب (هاب نواب)', 
                date: '1404/3/4', 
                id: 2 
            },
            { 
                hub:{
                    name:'هاب تهران',
                    address:'تهران شریعتی نرسیده به پل رومی',
                    id:12,
                    lat:51.453534,
                    lng:35.45645
                },
                number:'123456',
                timeRange: [8, 11], 
                amount: 12300000, 
                zone: 'میدان انقلاب (هاب نواب)', 
                date: '1404/3/4', 
                id: 3 
            },

        ]
    },
    {
        dateArray: [1404, 1, 7],
        shifts: [
            { 
                hub:{
                    name:'هاب تهران',
                    address:'تهران شریعتی نرسیده به پل رومی',
                    id:12,
                    lat:51.453534,
                    lng:35.45645
                },
                number:'123456',
                timeRange: [8, 11], 
                amount: 12300000, 
                zone: 'میدان انقلاب (هاب نواب)', 
                date: '1404/3/4', 
                id: 4 
            },
            { 
                hub:{
                    name:'هاب تهران',
                    address:'تهران شریعتی نرسیده به پل رومی',
                    id:12,
                    lat:51.453534,
                    lng:35.45645
                },
                number:'123456',
                timeRange: [8, 11], 
                amount: 12300000, 
                zone: 'میدان انقلاب (هاب نواب)', 
                date: '1404/3/4', 
                id: 5 
            },
            { 
                hub:{
                    name:'هاب تهران',
                    address:'تهران شریعتی نرسیده به پل رومی',
                    id:12,
                    lat:51.453534,
                    lng:35.45645
                },
                number:'123456',
                timeRange: [8, 11], 
                amount: 12300000, 
                zone: 'میدان انقلاب (هاب نواب)', 
                date: '1404/3/4', 
                id: 6 
            },
            { 
                hub:{
                    name:'هاب تهران',
                    address:'تهران شریعتی نرسیده به پل رومی',
                    id:12,
                    lat:51.453534,
                    lng:35.45645
                },
                number:'123456',
                timeRange: [8, 11], 
                amount: 12300000, 
                zone: 'میدان انقلاب (هاب نواب)', 
                date: '1404/3/4', 
                id: 7 
            },
            { 
                hub:{
                    name:'هاب تهران',
                    address:'تهران شریعتی نرسیده به پل رومی',
                    id:12,
                    lat:51.453534,
                    lng:35.45645
                },
                number:'123456',
                timeRange: [8, 11], 
                amount: 12300000, 
                zone: 'میدان انقلاب (هاب نواب)', 
                date: '1404/3/4', 
                id: 8 
            },
            { 
                hub:{
                    name:'هاب تهران',
                    address:'تهران شریعتی نرسیده به پل رومی',
                    id:12,
                    lat:51.453534,
                    lng:35.45645
                },
                number:'123456',
                timeRange: [8, 11], 
                amount: 12300000, 
                zone: 'میدان انقلاب (هاب نواب)', 
                date: '1404/3/4', 
                id: 9 
            },
            { 
                hub:{
                    name:'هاب تهران',
                    address:'تهران شریعتی نرسیده به پل رومی',
                    id:12,
                    lat:51.453534,
                    lng:35.45645
                },
                number:'123456',
                timeRange: [8, 11], 
                amount: 12300000, 
                zone: 'میدان انقلاب (هاب نواب)', 
                date: '1404/3/4', 
                id: 10 
            },

        ]
    }
]
